pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
/*
 * Copyright (c) 2020, Pycom Limited.
 *
 * This software is licensed under the GNU GPL version 3 or any
 * later version, with permitted additional terms. For more information
 * see the Pycom Licence v1.0 document supplied with this file, or
 * available at https://www.pycom.io/opensource/licensing
 */

#include "py/mpconfig.h"
#include "py/obj.h"
#include "py/objstr.h"
#include "py/runtime.h"
#include "mperror.h"
#include "updater.h"
#include "modled.h"

#include "esp_system.h"
#include "nvs_flash.h"
#include "nvs.h"

#include "pycom_config.h"
#include "mpexception.h"
#include "machpin.h"
#include "driver/rmt.h"
#include "driver/gpio.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "antenna.h"
#include "py/mphal.h"

#include "pycom_bootloader.h"
#include "updater.h"

#include "mptask.h"

#include "modmachine.h"
#include "esp32chipinfo.h"
#include "modwlan.h"
#include "pycom_general_util.h"



#include <string.h>

extern led_info_t led_info;


#define NVS_NAMESPACE                           "PY_NVM"

#define WDT_ON_BOOT_MIN_TIMEOUT_MS              (5000)

static nvs_handle pycom_nvs_handle;
boot_info_t boot_info;
uint32_t boot_info_offset;

static void modpycom_bootmgr(uint8_t boot_partition, uint8_t fs_type, uint8_t safeboot, bool reset);

void modpycom_init0(void) {
    if (nvs_open(NVS_NAMESPACE, NVS_READWRITE, &pycom_nvs_handle) != ESP_OK) {
        mp_printf(&mp_plat_print, "Error while opening Pycom NVS name space\n");
    }
    rmt_driver_install(RMT_CHANNEL_0, 1000, 0);
    if (updater_read_boot_info (&boot_info, &boot_info_offset) == false) {
        mp_printf(&mp_plat_print, "Error reading bootloader information!\n");
    }
}

static void modpycom_bootmgr(uint8_t boot_partition, uint8_t fs_type, uint8_t safeboot, bool reset) {
    bool update_part = false;
    bool update_fstype = false;
    bool update_safeboot = false;

    if (boot_partition < 255) {
        if ((boot_partition <= IMG_ACT_UPDATE1) && (boot_info.ActiveImg != boot_partition)) {
            boot_info.PrevImg = boot_info.ActiveImg;
            boot_info.ActiveImg = (uint32_t)boot_partition;
            boot_info.Status = IMG_STATUS_CHECK;
            update_part = true;
        } else {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Error invalid boot partition! or partition already active!"));
        }
    }
    if (safeboot < 255) {
        if ((safeboot <= 1) && (safeboot != boot_info.safeboot)) {
            if(safeboot)
            {
                boot_info.safeboot = (uint32_t)SAFE_BOOT_SW;
            }
            else
            {
                boot_info.safeboot = (uint32_t)0x00;
            }
            update_safeboot = true;
        } else {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Error safeboot must be True or False!"));
        }
    }
    if (fs_type < 255) {
        if (fs_type <= 1) {
            if(config_get_boot_fs_type() != fs_type)
            {
                config_set_boot_fs_type(fs_type);
                update_fstype = true;
            }
        }
        else {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Error invalid filesystem type!"));
        }
    }
    if (update_part || update_safeboot) {
        if (updater_write_boot_info (&boot_info, boot_info_offset) == false) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Error writing bootloader information!"));
        }
        if(update_part)
        {
            machine_reset();
        }
    }
    if((update_fstype || update_safeboot) && reset)
    {
        machine_reset();
    }
}

/******************************************************************************/
// Micro Python bindings


STATIC mp_obj_t mod_pycom_heartbeat (mp_uint_t n_args, const mp_obj_t *args) {
#ifndef CONFIG_PYCOM_RGB_LED_DISABLE
    if (n_args) {
        mperror_enable_heartbeat (mp_obj_is_true(args[0]));
        if (!mp_obj_is_true(args[0])) {
            do {
                mp_hal_delay_ms(2);
            } while (!mperror_heartbeat_disable_done());
        }
    } else {
        return mp_obj_new_bool(mperror_is_heartbeat_enabled());
    }
#else
    nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "RGB Led Interface Disabled"));
#endif
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_heartbeat_obj, 0, 1, mod_pycom_heartbeat);

STATIC mp_obj_t mod_pycom_rgb_led (mp_uint_t n_args, const mp_obj_t *args) {
#ifndef CONFIG_PYCOM_RGB_LED_DISABLE
    if (mperror_is_heartbeat_enabled()) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_request_not_possible));
    }
    if(n_args > 0){
        uint32_t color = mp_obj_get_int(args[0]);
        led_info.color.value = color;
        led_set_color(&led_info, true, false);
    } else {
        return mp_obj_new_int(led_info.color.value);
    }
#else
    nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "RGB Led Interface Disabled"));
#endif

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_rgb_led_obj, 0,1,mod_pycom_rgb_led);

STATIC mp_obj_t mod_pycom_ota_start (void) {
    if (!updater_start()) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_ota_start_obj, mod_pycom_ota_start);

STATIC mp_obj_t mod_pycom_ota_write (mp_obj_t data) {
    mp_buffer_info_t bufinfo;
    mp_get_buffer_raise(data, &bufinfo, MP_BUFFER_READ);

    if (!updater_write(bufinfo.buf, bufinfo.len)) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mod_pycom_ota_write_obj, mod_pycom_ota_write);

STATIC mp_obj_t mod_pycom_ota_finish (void) {
    if (!updater_finish()) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, mpexception_os_operation_failed));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_ota_finish_obj, mod_pycom_ota_finish);

STATIC mp_obj_t mod_pycom_ota_verify (void) {
    bool ret_val = updater_verify();
    return mp_obj_new_bool(ret_val);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_ota_verify_obj, mod_pycom_ota_verify);

