pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
STATIC mp_obj_t mod_pycom_wifi_pwd_sta (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        if(args[0] == mp_const_none)
        {
            config_set_wifi_sta_pwd (NULL, true);
        }
        else if (MP_OBJ_IS_STR(args[0]))
        {
            config_set_wifi_sta_pwd ((uint8_t *)(mp_obj_str_get_str(args[0])), true);
        }
        else{/*Nothing*/}
    } else {
        uint8_t * pwd = (uint8_t *)malloc(65);
        mp_obj_t pwd_obj;
        if(config_get_wifi_sta_pwd(pwd))
        {
            pwd_obj = mp_obj_new_str((const char *)pwd, strlen((const char *)pwd));
        }
        else
        {
            pwd_obj = mp_const_none;
        }
        free(pwd);
        return pwd_obj;
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wifi_pwd_sta_obj, 0, 1, mod_pycom_wifi_pwd_sta);

STATIC mp_obj_t mod_pycom_wifi_ssid_ap (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        if(args[0] == mp_const_none)
        {
            config_set_wifi_ap_ssid (NULL);
        }
        else if (MP_OBJ_IS_STR(args[0]))
        {
            config_set_wifi_ap_ssid ((uint8_t *)(mp_obj_str_get_str(args[0])));
        }
        else{/*Nothing*/}
    } else {
        uint8_t * ssid = (uint8_t *)malloc(33);
        mp_obj_t ssid_obj;
        if(config_get_wifi_ap_ssid(ssid))
        {
            ssid_obj = mp_obj_new_str((const char *)ssid, strlen((const char *)ssid));
        }
        else
        {
            ssid_obj = mp_const_none;
        }
        free(ssid);
        return ssid_obj;
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wifi_ssid_ap_obj, 0, 1, mod_pycom_wifi_ssid_ap);

STATIC mp_obj_t mod_pycom_wifi_pwd_ap (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        if(args[0] == mp_const_none)
        {
            config_set_wifi_ap_pwd (NULL);
        }
        else if (MP_OBJ_IS_STR(args[0]))
        {
            config_set_wifi_ap_pwd ((uint8_t *)(mp_obj_str_get_str(args[0])));
        }
        else{/*Nothing*/}
    } else {
        uint8_t * pwd = (uint8_t *)malloc(65);
        mp_obj_t pwd_obj;
        if(config_get_wifi_ap_pwd(pwd))
        {
            pwd_obj = mp_obj_new_str((const char *)pwd, strlen((const char *)pwd));
        }
        else
        {
            pwd_obj = mp_const_none;
        }
        free(pwd);
        return pwd_obj;
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wifi_pwd_ap_obj, 0, 1, mod_pycom_wifi_pwd_ap);


STATIC mp_obj_t mod_pycom_wdt_on_boot (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_wdt_on_boot (mp_obj_is_true(args[0]));
    } else {
        return mp_obj_new_bool(config_get_wdt_on_boot());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wdt_on_boot_obj, 0, 1, mod_pycom_wdt_on_boot);

STATIC mp_obj_t mod_pycom_wdt_on_boot_timeout (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        uint32_t timeout_ms = mp_obj_get_int(args[0]);
        if (timeout_ms < WDT_ON_BOOT_MIN_TIMEOUT_MS) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "WDT on boot timeout must be >= 5000 ms"));
        }
        config_set_wdt_on_boot_timeout (timeout_ms);
    } else {
        return mp_obj_new_int_from_uint(config_get_wdt_on_boot_timeout());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_wdt_on_boot_timeout_obj, 0, 1, mod_pycom_wdt_on_boot_timeout);

STATIC mp_obj_t mod_pycom_heartbeat_on_boot (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_heartbeat_on_boot (mp_obj_is_true(args[0]));
    } else {
        return mp_obj_new_bool(config_get_heartbeat_on_boot());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_heartbeat_on_boot_obj, 0, 1, mod_pycom_heartbeat_on_boot);

STATIC mp_obj_t mod_pycom_rgb_led_on_boot (mp_uint_t n_args, const mp_obj_t *args) {
#ifndef CONFIG_PYCOM_RGB_LED_DISABLE
    if (n_args) {
      if (!mp_obj_is_int(args[0])) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "RGB Led color bad format"));
        return mp_const_none;
      }
      if (config_set_rgb_led_on_boot(mp_obj_get_int(args[0])))
      {
      } else {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "RGB Led set failed"));
      }
    } else {
      return mp_obj_new_int(config_get_rgb_led_on_boot());
    }
#else
    nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "RGB Led Interface Disabled"));
#endif

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_rgb_led_on_boot_obj, 0, 1, mod_pycom_rgb_led_on_boot);

STATIC mp_obj_t mod_pycom_lte_modem_on_boot (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_lte_modem_enable_on_boot (mp_obj_is_true(args[0]));
    } else {
        return mp_obj_new_bool(config_get_lte_modem_enable_on_boot());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_lte_modem_on_boot_obj, 0, 1, mod_pycom_lte_modem_on_boot);

#if (VARIANT == PYBYTES)

STATIC mp_obj_t mod_pycom_pybytes_on_boot (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_pybytes_autostart (mp_obj_is_true(args[0]));
    } else {
        return mp_obj_new_bool(config_get_pybytes_autostart());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_pybytes_on_boot_obj, 0, 1, mod_pycom_pybytes_on_boot);

STATIC mp_obj_t mod_pycom_pybytes_lte_config (size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_carrier, ARG_apn, ARG_cid, ARG_band, ARG_type, ARG_reset };
    STATIC const mp_arg_t allowed_args[] = {
            { MP_QSTR_carrier,          MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
            { MP_QSTR_apn,              MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
            { MP_QSTR_cid,              MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
            { MP_QSTR_band,             MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
            { MP_QSTR_type,             MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },
            { MP_QSTR_reset,            MP_ARG_KW_ONLY | MP_ARG_OBJ, {.u_obj = mp_const_none} },

