pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    pycom_pybytes_lte_config_t pycom_pybytes_lte_config = config_get_pybytes_lte_config();

    if (n_args == 0) {
        mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(6, NULL));

        if(pycom_pybytes_lte_config.carrier[0] == 0xFF && pycom_pybytes_lte_config.carrier[1] == 0xFF && pycom_pybytes_lte_config.carrier[2] == 0xFF)
        {
            t->items[ARG_carrier] = mp_const_none;
        }
        else
        {
            t->items[ARG_carrier] = mp_obj_new_str((const char *)pycom_pybytes_lte_config.carrier, strlen((const char *)pycom_pybytes_lte_config.carrier));
        }

        if(pycom_pybytes_lte_config.apn[0] == 0xFF && pycom_pybytes_lte_config.apn[1] == 0xFF && pycom_pybytes_lte_config.apn[2] == 0xFF)
        {
            t->items[ARG_apn] = mp_const_none;
        }
        else
        {
            t->items[ARG_apn] = mp_obj_new_str((const char *)pycom_pybytes_lte_config.apn, strlen((const char *)pycom_pybytes_lte_config.apn));
        }
        if(pycom_pybytes_lte_config.cid == 0xFF)
        {
            t->items[ARG_cid] = mp_obj_new_int(1);
        }
        else
        {
            t->items[ARG_cid] = mp_obj_new_int(pycom_pybytes_lte_config.cid);
        }
        if(pycom_pybytes_lte_config.band == 0xFF)
        {
            t->items[ARG_band] = mp_const_none;
        }
        else
        {
            t->items[ARG_band] = mp_obj_new_int(pycom_pybytes_lte_config.band);
        }
        if(pycom_pybytes_lte_config.type[0] == 0xFF)
        {
            t->items[ARG_type] = mp_const_none;
        }
        else
        {
            t->items[ARG_type] = mp_obj_new_str((const char *)pycom_pybytes_lte_config.type, strlen((const char *)pycom_pybytes_lte_config.type));
        }
        if(pycom_pybytes_lte_config.reset == 0xff)
        {
            t->items[ARG_reset] = mp_const_false;
        }
        else
        {
            t->items[ARG_reset] = mp_obj_new_bool(pycom_pybytes_lte_config.reset);
        }
        return MP_OBJ_FROM_PTR(t);

    } else {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Error this functionality is not yet supported!"));
    }

    return mp_const_none;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mod_pycom_pybytes_lte_config_obj, 0, mod_pycom_pybytes_lte_config);

#endif

STATIC mp_obj_t mod_pycom_bootmgr (size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_boot_partition, ARG_fs_type, ARG_safeboot, ARG_status };
    STATIC const mp_arg_t allowed_args[] = {
            { MP_QSTR_boot_partition,   MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 255} },
            { MP_QSTR_fs_type,          MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 255} },
            { MP_QSTR_safeboot,         MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 255} },
            { MP_QSTR_reset,            MP_ARG_KW_ONLY | MP_ARG_BOOL, {.u_bool = false} },
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    if (args[ARG_boot_partition].u_int == 255 && args[ARG_fs_type].u_int == 255 && args[ARG_safeboot].u_int == 255) {
        mp_obj_tuple_t *t = MP_OBJ_TO_PTR(mp_obj_new_tuple(4, NULL));

        if(boot_info.ActiveImg == 0x00)
        {
            t->items[ARG_boot_partition] = mp_obj_new_str("Factory", strlen("Factory"));
        }
        else
        {
            t->items[ARG_boot_partition] = mp_obj_new_str("ota_0", strlen("ota_0"));
        }

        if(config_get_boot_fs_type() == 0x00)
        {
            t->items[ARG_fs_type] = mp_obj_new_str("FAT", strlen("FAT"));
        }
        else
        {
            t->items[ARG_fs_type] = mp_obj_new_str("LittleFS", strlen("LittleFS"));
        }

        if(boot_info.safeboot == 0x00)
        {
            t->items[ARG_safeboot] = mp_obj_new_str("SafeBoot: False", strlen("SafeBoot: False"));
        }
        else
        {
            t->items[ARG_safeboot] = mp_obj_new_str("SafeBoot: True", strlen("SafeBoot: True"));
        }
        if(boot_info.Status == IMG_STATUS_CHECK)
        {
            t->items[ARG_status] = mp_obj_new_str("Status: Check", strlen("Status: Check"));
        }
        else if(boot_info.Status == IMG_STATUS_READY)
        {
            t->items[ARG_status] = mp_obj_new_str("Status: Ready", strlen("Status: Ready"));
        }
        else if(boot_info.Status == IMG_STATUS_PATCH)
        {
            t->items[ARG_status] = mp_obj_new_str("Status: Patch", strlen("Status: Patch"));
        }

        return MP_OBJ_FROM_PTR(t);

    } else {
        modpycom_bootmgr(args[ARG_boot_partition].u_int, args[ARG_fs_type].u_int, args[ARG_safeboot].u_int, args[3].u_bool);
    }

    return mp_const_none;
}

STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mod_pycom_bootmgr_obj, 0, mod_pycom_bootmgr);

STATIC mp_obj_t mod_pycom_get_free_heap (void) {

    size_t heap_psram_free = 0;
    mp_obj_t items[2];

    if (esp32_get_chip_rev() > 0) {
        heap_psram_free = heap_caps_get_free_size(MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
    }
    items[0] = mp_obj_new_int(heap_caps_get_free_size(MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if(heap_psram_free)
    {
        items[1] = mp_obj_new_int(heap_psram_free);
    }
    else
    {
        items[1] = mp_obj_new_str("NO_EXT_RAM", strlen("NO_EXT_RAM"));
    }

    return mp_obj_new_tuple(2, items);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_get_free_heap_obj, mod_pycom_get_free_heap);

#if (VARIANT == PYBYTES)

STATIC mp_obj_t mod_pycom_pybytes_device_token(mp_uint_t n_args, const mp_obj_t *args) {

    if (n_args) {
        uint8_t *token_ptr;
        token_ptr = (uint8_t *)mp_obj_str_get_str(args[0]);

        if (!config_set_pybytes_device_token(token_ptr)) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "Failed to write Device Token"));
        }

        return mp_const_none;
    } else {
        uint8_t pybytes_device_token[39];

        config_get_pybytes_device_token(pybytes_device_token);
        return mp_obj_new_str((const char *)pybytes_device_token, strlen((const char *)pybytes_device_token));
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_pybytes_device_token_obj, 0, 1, mod_pycom_pybytes_device_token);

