pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
STATIC mp_obj_t mod_pycom_pybytes_ota_status (mp_uint_t n_args, const mp_obj_t *args) {

    if (n_args) {
        uint8_t status;
        status = mp_obj_get_int(args[0]);

        if (!config_set_pybytes_ota_status(status)) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "Failed to write OTA Status"));
        }
        return mp_const_none;
    } else {
        return mp_obj_new_int(config_get_pybytes_ota_status());
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_pybytes_ota_status_obj, 0, 1, mod_pycom_pybytes_ota_status);

STATIC mp_obj_t mod_pycom_pybytes_fwtype (mp_uint_t n_args, const mp_obj_t *args) {

    if (n_args) {
        uint8_t fwtype;
        fwtype = mp_obj_get_int(args[0]);

        if (!config_set_pybytes_fwtype(fwtype)) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "Failed to write fwtype"));
        }
        return mp_const_none;
    } else {
        return mp_obj_new_int(config_get_pybytes_fwtype());
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_pybytes_fwtype_obj, 0, 1, mod_pycom_pybytes_fwtype);

STATIC mp_obj_t mod_pycom_pybytes_sysname (mp_uint_t n_args, const mp_obj_t *args) {

    if (n_args) {
        uint8_t *sysname_ptr;
        sysname_ptr = (uint8_t *)mp_obj_str_get_str(args[0]);

        if (!config_set_pybytes_sysname(sysname_ptr)) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "Failed to write sysname"));
        }

        return mp_const_none;
    } else {
        uint8_t sysname[6];

        config_get_pybytes_sysname(sysname);
        return mp_obj_new_str((const char *)sysname, strlen((const char *)sysname));
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_pybytes_sysname_obj, 0, 1, mod_pycom_pybytes_sysname);

STATIC mp_obj_t mod_pycom_sw_version (mp_uint_t n_args, const mp_obj_t *args) {

    if (n_args) {
        uint8_t *version;
        version = (uint8_t *)mp_obj_str_get_str(args[0]);

        if (!config_set_sw_version(version)) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_OSError, "Failed to write SW Version"));
        }

        return mp_const_none;
    } else {
        uint8_t sw_version[12];

        config_get_sw_version(sw_version);
        return mp_obj_new_str((const char *)sw_version, strlen((const char *)sw_version));
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_sw_version_obj, 0, 1, mod_pycom_sw_version);


STATIC mp_obj_t mod_pycom_pybytes_mqttServiceAddress (void) {
    uint8_t pybytes_mqttServiceAddress[39];
    config_get_pybytes_mqttServiceAddress(pybytes_mqttServiceAddress);
    return mp_obj_new_str((const char*)pybytes_mqttServiceAddress,strlen((const char*)pybytes_mqttServiceAddress));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_mqttServiceAddress_obj, mod_pycom_pybytes_mqttServiceAddress);

STATIC mp_obj_t mod_pycom_pybytes_userId (void) {
    uint8_t pybytes_userId[254];
    config_get_pybytes_userId(pybytes_userId);
    return mp_obj_new_str((const char*)pybytes_userId,strlen((const char*)pybytes_userId));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_userId_obj, mod_pycom_pybytes_userId);

STATIC mp_obj_t mod_pycom_pybytes_network_preferences (void) {
    uint8_t pybytes_network_preferences[54];
    config_get_pybytes_network_preferences(pybytes_network_preferences);
    return mp_obj_new_str((const char*)pybytes_network_preferences,strlen((const char*)pybytes_network_preferences));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_network_preferences_obj, mod_pycom_pybytes_network_preferences);

STATIC mp_obj_t mod_pycom_pybytes_extra_preferences (void) {
    uint8_t pybytes_extra_preferences[99];
    config_get_pybytes_extra_preferences(pybytes_extra_preferences);
    return mp_obj_new_str((const char*)pybytes_extra_preferences,strlen((const char*)pybytes_extra_preferences));
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(mod_pycom_pybytes_extra_preferences_obj, mod_pycom_pybytes_extra_preferences);

STATIC mp_obj_t mod_pycom_pybytes_force_update (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_pybytes_force_update (mp_obj_is_true(args[0]));
    } else {
        return mp_obj_new_bool(config_get_pybytes_force_update());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_pybytes_force_update_obj, 0, 1, mod_pycom_pybytes_force_update);

STATIC mp_obj_t mod_pycom_smartConfig (mp_uint_t n_args, const mp_obj_t *args) {
    if (n_args) {
        config_set_wifi_smart_config ((uint8_t)(mp_obj_is_true(args[0])), true);
    } else {
        return mp_obj_new_bool(config_get_wifi_smart_config());
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mod_pycom_smartConfig_obj, 0, 1, mod_pycom_smartConfig);

#endif //(VARIANT == PYBYTES)

#if defined(FIPY) || defined(LOPY4) || defined(SIPY)

STATIC bool is_empty(uint8_t* value, uint8_t size) {
    bool ret_val = true;
    for (int i=0; i < size; i++) {
        if (value[i] != 0xFF) {
            ret_val = false;
        }
    }
    return ret_val;
}

STATIC mp_obj_t mod_pycom_sigfox_info (size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_id, ARG_pac, ARG_public_key, ARG_private_key, ARG_force };
    STATIC const mp_arg_t allowed_args[] = {
            { MP_QSTR_id,           MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_pac,          MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_public_key,   MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_private_key,  MP_ARG_KW_ONLY  | MP_ARG_OBJ,  {.u_obj = mp_const_none} },
            { MP_QSTR_force,        MP_ARG_KW_ONLY  | MP_ARG_BOOL, {.u_bool = false} }
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    uint8_t id[4];
    uint8_t pac[8];
    uint8_t public_key[16];
    uint8_t private_key[16];

