pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
    config_get_sigfox_id(id);
    config_get_sigfox_pac(pac);
    config_get_sigfox_public_key(public_key);
    config_get_sigfox_private_key(private_key);


    if (args[ARG_id].u_obj == mp_const_none && args[ARG_pac].u_obj == mp_const_none && args[ARG_public_key].u_obj == mp_const_none && args[ARG_private_key].u_obj == mp_const_none) {
        // query sigfox info

        if ( !is_empty(id, sizeof(id)) && !is_empty(pac, sizeof(pac)) && !is_empty(public_key, sizeof(public_key)) && !is_empty(private_key, sizeof(private_key)) ){
            // all configs valid
            return mp_const_true;
        } else {
            return mp_const_false;
        }
    } else {
        // write sigfox info

        // temporary array to store even the longest value from id, pac, public_key and private_key
        uint8_t tmp_array[16];
        size_t length;
        bool ret_val = false;

        if (args[ARG_id].u_obj != mp_const_none) {

            if ( args[ARG_force].u_bool == true || is_empty(id, sizeof(id)) ) {

                const char* id = mp_obj_str_get_data(args[ARG_id].u_obj, &length);

                if(length != 8) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "ID must have length of 8!"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(id[i+1]);
                    uint8_t upper_nibble = hex_from_char(id[i]);

                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "ID must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_id(tmp_array);
                if (ret_val == false) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Failed to write id"));
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing id!"));
            }
        }
        if (args[ARG_pac].u_obj != mp_const_none) {

            if (args[ARG_force].u_bool == true || is_empty(pac, sizeof(pac))) {

                const char* pac = mp_obj_str_get_data(args[ARG_pac].u_obj, &length);

                if(length != 16) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "PAC must have length of 16!"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(pac[i+1]);
                    uint8_t upper_nibble = hex_from_char(pac[i]);

                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "PAC must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_pac(tmp_array);
                if (ret_val == false) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Failed to write pac"));
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing pac!"));
            }
        }
        if (args[ARG_public_key].u_obj != mp_const_none) {

            if (args[ARG_force].u_bool == true || is_empty(public_key, sizeof(public_key))) {

                const char* public_key = mp_obj_str_get_data(args[ARG_public_key].u_obj, &length);

                if(length != 32) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Public Key must have length of 32!"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(public_key[i+1]);
                    uint8_t upper_nibble = hex_from_char(public_key[i]);

                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Public Key must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_public_key(tmp_array);
                if (ret_val == false) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Failed to write public key"));
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing public key!"));
            }

        }
        if (args[ARG_private_key].u_obj != mp_const_none) {

            if (args[ARG_force].u_bool == true || is_empty(private_key, sizeof(private_key))) {

                const char* private_key = mp_obj_str_get_data(args[ARG_private_key].u_obj, &length);

                if(length != 32) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Private Key must have length of 32"));
                }

                // Put together every 2 characters of the string (which are digits from 0 - 9 and a/A - f/F) into 1 bytes because the available space is half of the required one
                for(int i = 0, j = 0; i < length; i = i+2) {
                    uint8_t lower_nibble = hex_from_char(private_key[i+1]);
                    uint8_t upper_nibble = hex_from_char(private_key[i]);

