pycom/pycom-micropython-sigfox/esp32/mods/modpycom.c
                    if(lower_nibble == 16 || upper_nibble == 16) {
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Private Key must only contain hexadecimal digits!"));
                    }

                    tmp_array[j] = lower_nibble | (upper_nibble << 4);
                    j++;
                }

                ret_val = config_set_sigfox_private_key(tmp_array);
                if (ret_val == false) {
                    nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Failed to write private key"));
                }
            } else {
                nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Use force option to overwrite existing private key!"));
            }
        }
        return mp_const_true;
    }
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(mod_pycom_sigfox_info_obj, 0, mod_pycom_sigfox_info);

#endif // #if defined(FIPY) || defined(LOPY4) || defined(SIPY)

#include "ml.h"

STATIC mp_obj_t mod_pycom_ml_new_model (mp_obj_t model_definition) {

    const char *model_definition_str = mp_obj_str_get_str(model_definition);

    bool ret = new_model(model_definition_str);

    return mp_obj_new_bool(ret);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mod_pycom_ml_new_model_obj, mod_pycom_ml_new_model);

STATIC mp_obj_t mod_pycom_ml_run_model (mp_obj_t data) {

    // Get input data.
    mp_obj_t *list;
    size_t listlen = 0;

    mp_obj_list_get(data, &listlen, &list);

    float *data_buf = (float *)malloc(listlen * sizeof(float));
    for (int i = 0 ; i < listlen ; i++){
        data_buf[i] =  mp_obj_float_get(list[i]);
    }

    // Run inference.
    List* results = run_model(data_buf, listlen);

    free(data_buf);

    // Dictionary to hold results.
    mp_obj_dict_t *results_dct = mp_obj_new_dict(0);

    // For each output block, add results.
    l_for_each_entry(entry, results){

        ReturnedData *rd = (ReturnedData *) entry->data;

        mp_obj_t entry_l = mp_obj_new_list(0, NULL);

        for(int i = 0; i < rd->data->buffer_size; i++){

            mp_obj_list_append(entry_l, mp_obj_new_float(rd->data->buffer[i]));
        }

        // Add to dict.
        mp_obj_dict_store (results_dct, mp_obj_new_str(rd->block_id, strlen(rd->block_id)), entry_l);
    }

    // Free memory.
    l_delete_list(results);

    return results_dct;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(mod_pycom_ml_run_model_obj, mod_pycom_ml_run_model);

// This function creates a 128 bit long UUID stored in a byte array in Little Endian order from an input String
STATIC mp_obj_t create_128bit_le_uuid_from_string(mp_obj_t uuid_in) {

    size_t length;
    uint8_t new_uuid[16];
    uint8_t i, j;

    const char* uuid_char_in = mp_obj_str_get_data(uuid_in, &length);
    // 1 character is stored on 1 byte because we received a String
    // For 128 bit UUID maximum 32 characters long String can be accepted
    if (length > 32) {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Input string must not be longer than 32 characters!"));
    }

    // Pre-fill the whole array with 0 because the remaining/not given digits will be 0
    char uuid_char[32] = {0};
    memcpy(uuid_char, uuid_char_in, length);

    for(i = 0, j = 0; i < 32; i = i+2) {

        uint8_t lower_nibble = 0;
        uint8_t upper_nibble = 0;

        if(uuid_char[i] > 0) {
            upper_nibble = hex_from_char(uuid_char[i]);
        }

        if(uuid_char[i+1] > 0) {
            lower_nibble = hex_from_char(uuid_char[i+1]);
        }

        if(lower_nibble == 16 || upper_nibble == 16) {
            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "UUID must only contain hexadecimal digits!"));
        }

        // Pack together the 4 bits digits into 1 byte
        // Convert to Little Endian order because we expect that the digits of the input String follows the Natural Byte (Big Endian) order
        new_uuid[15-j] = lower_nibble | (upper_nibble << 4);
        j++;
    }

    mp_obj_t new_uuid_mp = mp_obj_new_bytearray(16, new_uuid);
    return new_uuid_mp;

}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(create_128bit_le_uuid_from_string_obj, create_128bit_le_uuid_from_string);

STATIC const mp_map_elem_t pycom_module_globals_table[] = {
        { MP_OBJ_NEW_QSTR(MP_QSTR___name__),                        MP_OBJ_NEW_QSTR(MP_QSTR_pycom) },
        { MP_OBJ_NEW_QSTR(MP_QSTR_heartbeat),                       (mp_obj_t)&mod_pycom_heartbeat_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_rgbled),                          (mp_obj_t)&mod_pycom_rgb_led_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_start),                       (mp_obj_t)&mod_pycom_ota_start_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_write),                       (mp_obj_t)&mod_pycom_ota_write_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_finish),                      (mp_obj_t)&mod_pycom_ota_finish_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_verify),                      (mp_obj_t)&mod_pycom_ota_verify_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ota_slot),                        (mp_obj_t)&mod_pycom_ota_slot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_diff_update_enabled),             (mp_obj_t)&mod_pycom_diff_update_enabled_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_factory_img),                     (mp_obj_t)&mod_pycom_factory_img_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_pulses_get),                      (mp_obj_t)&mod_pycom_pulses_get_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_set),                         (mp_obj_t)&mod_pycom_nvs_set_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_get),                         (mp_obj_t)&mod_pycom_nvs_get_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_erase),                       (mp_obj_t)&mod_pycom_nvs_erase_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_nvs_erase_all),                   (mp_obj_t)&mod_pycom_nvs_erase_all_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_on_boot),                    (mp_obj_t)&mod_pycom_wifi_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wdt_on_boot),                     (mp_obj_t)&mod_pycom_wdt_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wdt_on_boot_timeout),             (mp_obj_t)&mod_pycom_wdt_on_boot_timeout_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_heartbeat_on_boot),               (mp_obj_t)&mod_pycom_heartbeat_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_rgbled_on_boot),                  (mp_obj_t)&mod_pycom_rgb_led_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_lte_modem_en_on_boot),            (mp_obj_t)&mod_pycom_lte_modem_on_boot_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_get_free_heap),                   (mp_obj_t)&mod_pycom_get_free_heap_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_ssid_sta),                   (mp_obj_t)&mod_pycom_wifi_ssid_sta_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_ssid_ap),                    (mp_obj_t)&mod_pycom_wifi_ssid_ap_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_pwd_sta),                    (mp_obj_t)&mod_pycom_wifi_pwd_sta_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_pwd_ap),                     (mp_obj_t)&mod_pycom_wifi_pwd_ap_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_wifi_mode_on_boot),               (mp_obj_t)&mod_pycom_wifi_mode_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ml_new_model),                    (mp_obj_t)&mod_pycom_ml_new_model_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_ml_run_model),                    (mp_obj_t)&mod_pycom_ml_run_model_obj },
        { MP_OBJ_NEW_QSTR(MP_QSTR_create_128bit_le_uuid_from_string), (mp_obj_t)&create_128bit_le_uuid_from_string_obj },


